[
    {
        "Job ID": "No job id",
        "Title": "Data Engineer - Amsterdam",
        "Company": "Tesla",
        "Location": "Amsterdam, North Holland, Netherlands",
        "Salary": "No salary",
        "Description": "What To ExpectTesla is accelerating the world's transition to sustainable energy. Revolutionary strategies and products were developed within a few years and successfully launched on a large scale. This is only possible through extraordinary speed, innovation and efficiency.The RoleTesla is seeking a talented and motivated Data Engineer to join our Data and Analytics team at Tesla. We are building a state of the art analytics platform for business and operation intelligence. At Tesla, we have enormous amounts of data and we want to give meaning to it and help business users to make data driven decisions. Our platform will allow users to answer \"what\", \"when\" and \"how\" questions as well as allow them to ask \"what if\". This person will design, develop, maintain and support our Enterprise Data Warehouse & BI platform within Tesla using various data & BI tools and this position offers unique opportunity to make significant impact to the entire organization in developing data tools and driving data driven culture.What You’ll DoWork in a time constrained environment to analyze, design, develop and deliver Enterprise Data Warehouse solutions Strong Expertise in SQL query skills Create ETL/ELT pipelines using Python, Airflow Design, develop, maintain and support our Enterprise Data Warehouse & BI platform within Tesla using various data & BI tools Build ad-hoc applications as needed to support more curious data users and to provide automation as possible Work with systems that handle sensitive data with strict SOX controls and change management processes Develop collaborative relationships and work with key business sponsors, IT resources to gather requirements and for the efficient resolution of requests. Provide timely and accurate estimates for newly proposed functionality enhancements Communicate technical and business topics, as appropriate, in a 360 degree fashion, when required; communicate using written, verbal and/or presentation materials as necessary. Keep up to date on relevant technologies and frameworks What You’ll Bring2-4 years of experience in creating data pipelines using SQL / Python / Airflow is required Experience with designing DataMart, Data Warehouse, database objects within relational databases MySQL, SQL-Server, Vertica is good to have. Strong proficiency in SQL and query writing is required Familiarity with common API’s: REST, SOAP Work experience with Tableau / PowerBI/ SSRS Good Problem-Solving, Verbal and Written communication skills Excellent analytical, organizational skills and ability to work under pressure/deliver on tight deadlines is a must Hands on experience in stellar dashboards and reports creation for C-level executive Nice To HaveExperience with data science tools such as Pandas, Numpy, R 3+ years of development experience in Open-Source technologies like Python, Java is preferred Understanding of distributed computing Work experience with Python, SSIS, Informatica"
    }
]