[
    {
        "Job ID": "No job id",
        "Title": "Software Engineer (Early Career)",
        "Company": "Apple",
        "Location": "Austin, TX",
        "Salary": "No salary",
        "Description": "Summary Imagine what you could do here. At Apple, phenomenal ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!Appleʼs Applied Machine Learning team has built systems for a number of large scale data science applications. Our Platform runs on thousands of machines and serves 100’s of millions of request per day. We work on many high-impact projects that serve various Apple lines of business. We use the latest in open source technology and as committers on some of these projects, we are pushing the envelope. Working with multiple lines of business, we manage many streams of Apple-scale data. We bring it all together and extract the value. We do all this with an exceptional group of software engineers, data scientists, dev-ops engineers and managers. If you're up for a challenge, then this is the place for you! Key Qualifications Familiarity with software development in Python, Java or GoFamiliarity with Data Structures Familiarity with fundamentals of a machine learning development lifecycleStrong ability to learn new technologies in a short timeWill be able to contribute to platform design, architecture, development, maintenance and production supportExposure to Kubernetes, Machine Learning offerings from Amazon AWS/GCP Description We are looking for a Software Engineer who will be responsible for the design, build and enhancements of a scalable highly concurrent distributed platform. Knowledge of popular Machine Learning tools and packages is helpful, but can be an ongoing skill acquisition as part of the job. The mindset needed to be successful is being able to process thousands of transactions per second consistently without sacrificing performance. Education & Experience BS or MS in Computer Science or related field Additional Requirements Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace. Role Number: 200336111"
    }
]